EDT/УТ/src/Reports/ОтчетАгентаTopDelivery/ОтчетАгентаTopDelivery.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетАгентаTopDelivery</name>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/РасчетУслугСД/РасчетУслугСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетУслугСД</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказательУслуг</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаУслугСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тариф</name>
    <type>
      <types>CatalogRef.ТарифыДополнительныхУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Reports/ОтчетАгентаTopDelivery/ObjectModule.bsl
Функция Сформировать(Таб, НачДата, КонДата, МассивКонтр) Экспорт
	Таб.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = ТекстЗапросаЗаказы();				
				
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачДата));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонДата));			
	Зап.УстановитьПараметр("МасКонтр", МассивКонтр);			
	
	Рез = Зап.Выполнить().Выгрузить();
	
	Мак = ПолучитьМакет("Макет");
	
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблС = Мак.ПолучитьОбласть("Строка");
	
	Таб.Вывести(ОблШ);
	
	НПП = 1;
	
	Для Каждого Тек Из Рез Цикл
		Ном2 = СтрПолучитьСтроку(СтрЗаменить(Тек.ВнешнийНомерЗаказа, "*", Символы.ПС), 2);
		ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
		
		Если Не ЗначениеЗаполнено(Тек.КоличествоДополнительныхВызовов) Тогда
			УслугиСД = Тек.СтоимостьДоставки;
			СтоимостьДопВыездов = 0;
		Иначе
			УслугиСД = Тек.СтоимостьДоставки/(Тек.КоличествоДополнительныхВызовов + 1);
			СтоимостьДопВыездов = Тек.КоличествоДополнительныхВызовов*УслугиСД;
		КонецеСли;	
		
		ОблС.Параметры.ВнешнийНомерЗаказа = Ном2;
		ОблС.Параметры.НПП = НПП;
		ОблС.Параметры.СтоимостьДоставки = УслугиСД;
		ОблС.Параметры.СтоимостьДопВыездов = СтоимостьДопВыездов;
		НПП = НПП + 1;
		Таб.Вывести(ОблС);
	КонецЦикла;	
	
	Зап = Новый Запрос;
	Зап.Текст = ТекстЗапросаЗаборовВозвратов();				
			
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачДата));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонДата));			
	Зап.УстановитьПараметр("МасКонтр", МассивКонтр);
	Рез = Зап.Выполнить().Выгрузить();	
	
	ОблР = Мак.ПолучитьОбласть("Разделитель");
	
	ОблШ = Мак.ПолучитьОбласть("ШапкаЗаборы");
	ОблС = Мак.ПолучитьОбласть("СтрокаЗаборы");
	
	Таб.Вывести(ОблР);
	Таб.Вывести(ОблШ);
	
	НПП = 1;
	
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
		ОблС.Параметры.НПП = НПП;
		НПП = НПП + 1;
		Таб.Вывести(ОблС);
	КонецЦикла;	
	
	
	Возврат Таб;
КонецФункции	


Функция ТекстЗапросаЗаказы()
	Возврат "ВЫБРАТЬ
	        |	ЗакрытыеЗаказыОбороты.Реализация.Ссылка КАК Заказ,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ новаОтчетВодителяЗадания.Ссылка.Ссылка) КАК КоличествоВыездов
	        |ПОМЕСТИТЬ ВТКоличествоВыездов
	        |ИЗ
	        |	РегистрНакопления.ЗакрытыеЗаказы.Обороты(&НачДата, &КонДата, , ИнтернетМагазин В (&МасКонтр)) КАК ЗакрытыеЗаказыОбороты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.новаОтчетВодителя.Задания КАК новаОтчетВодителяЗадания
	        |		ПО ЗакрытыеЗаказыОбороты.Реализация.Номер = новаОтчетВодителяЗадания.Задание.Номер
	        |ГДЕ
	        |	новаОтчетВодителяЗадания.ПричинаНевыполнения.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносСЗаездом))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗакрытыеЗаказыОбороты.Реализация.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
	        |	ЗакрытыеЗаказыОбороты.МассаОборот * 1000 КАК Вес,
	        |	ЗакрытыеЗаказыОбороты.ОплаченоКлиентовНалОборот - ЗакрытыеЗаказыОбороты.ПредоплатаПоКредитуОборот КАК ПолученоОтПокупателя,
	        |	ЗакрытыеЗаказыОбороты.УслугиСДОборот КАК СтоимостьДоставки,
	        |	ЗакрытыеЗаказыОбороты.КассовоеОбслуживаниеОборот КАК КассовоеОбслуживание,
	        |	ЕСТЬNULL(РасчетУслугСДОбороты.СуммаОборот, 0) КАК Подъем,
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК Баркод,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Ссылка КАК Заказ,
	        |	ЕСТЬNULL(ВТКоличествоВыездов.КоличествоВыездов, 0) КАК КоличествоДополнительныхВызовов,
	        |	ВЫБОР
	        |		КОГДА ЗакрытыеЗаказыОбороты.ТипОплаты.Код = 1
	        |			ТОГДА ЗакрытыеЗаказыОбороты.СуммаОценочнаяОборот + ЗакрытыеЗаказыОбороты.СуммаДоставкиЗаМКАДОборот + ЗакрытыеЗаказыОбороты.СуммаДоставкиДоМКАДОборот
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК СуммаЗаказаНал,
	        |	ЗакрытыеЗаказыОбороты.СуммаВозвратаОборот КАК СуммаВозврата,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Номер КАК Номер
	        |ИЗ
	        |	РегистрНакопления.ЗакрытыеЗаказы.Обороты(
	        |			&НачДата,
	        |			&КонДата,
	        |			,
	        |			ИнтернетМагазин.Ссылка В (&МасКонтр)
	        |				И СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.статусзаказаинтернетмагазина.заказзакрыт)) КАК ЗакрытыеЗаказыОбороты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетУслугСД.Обороты(&НачДата, &КонДата, , ПоказательУслуг.Ссылка = ЗНАЧЕНИЕ(Справочник.показателиРасчетаУслугСД.Подъем)) КАК РасчетУслугСДОбороты
	        |		ПО ЗакрытыеЗаказыОбороты.Реализация.Ссылка = РасчетУслугСДОбороты.Реализация.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоВыездов КАК ВТКоличествоВыездов
	        |		ПО ЗакрытыеЗаказыОбороты.Реализация.Ссылка = ВТКоличествоВыездов.Заказ.Ссылка
	        |ГДЕ
	        |	ЗакрытыеЗаказыОбороты.ТипЗаказа В (ЗНАЧЕНИЕ(Перечисление.Типызаказов.Доставка), ЗНАЧЕНИЕ(Перечисление.Типызаказов.самовывоз))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ВТКоличествоВыездов";
КонецФункции	

Функция ТекстЗапросаЗаборов()
	Возврат "ВЫБРАТЬ
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
	        |	ЗакрытыеЗаказыОбороты.УслугиСДОборот КАК СтоимостьДоставки,
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК Баркод,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Ссылка КАК Заказ,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Дата КАК ДатаЗабора,
	        |	ЗакрытыеЗаказыОбороты.Реализация.АдресДоставки КАК АдресЗабора
	        |ИЗ
	        |	РегистрНакопления.ЗакрытыеЗаказы.Обороты(
	        |			&НачДата,
	        |			&КонДата,
	        |			,
	        |			ИнтернетМагазин.Ссылка В (&МасКонтр)
	        |				И СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.статусзаказаинтернетмагазина.заказзакрыт)) КАК ЗакрытыеЗаказыОбороты
	        |ГДЕ
	        |	ЗакрытыеЗаказыОбороты.ТипЗаказа В (ЗНАЧЕНИЕ(Перечисление.Типызаказов.Забор))";
КонецФункции	



Функция ТекстЗапросаЗаборовВозвратов()
	Возврат "ВЫБРАТЬ
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа,
	        |	ЗакрытыеЗаказыОбороты.УслугиСДОборот КАК СтоимостьДоставки,
	        |	ЗакрытыеЗаказыОбороты.Реализация.НомерВнешнегоЗаказа КАК Баркод,
	        |	ЗакрытыеЗаказыОбороты.Реализация.Дата КАК ДатаЗабора,
	        |	""Забор"" КАК ТипОтправки
	        |ИЗ
	        |	РегистрНакопления.ЗакрытыеЗаказы.Обороты(
	        |			&НачДата,
	        |			&КонДата,
	        |			,
	        |			ИнтернетМагазин.Ссылка В (&МасКонтр)
	        |				И СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.статусзаказаинтернетмагазина.заказзакрыт)) КАК ЗакрытыеЗаказыОбороты
	        |ГДЕ
	        |	ЗакрытыеЗаказыОбороты.ТипЗаказа В (ЗНАЧЕНИЕ(Перечисление.Типызаказов.Забор))
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	"""",
	        |	"""",
	        |	"""",
	        |	ВозвратТоваровПоставщику.Дата,
	        |	""Возврат""
	        |ИЗ
	        |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	        |ГДЕ
	        |	ВозвратТоваровПоставщику.Проведен = ИСТИНА
	        |	И ВозвратТоваровПоставщику.Дата МЕЖДУ &НачДата И &КонДата
	        |	И ВозвратТоваровПоставщику.Контрагент В(&МасКонтр)";
КонецФункции	


Функция ВыгрузитьXML(Кат, НачДата, КонДата, МассивКонтр) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = ТекстЗапросаЗаказы();				
				
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачДата));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонДата));			
	Зап.УстановитьПараметр("МасКонтр", МассивКонтр);			
	
	Выб = Зап.Выполнить().Выбрать();
	
	
	Г = Новый УникальныйИдентификатор;
	
	ПутьКФайлу = Кат + "\" + "_subagent-report_" + Строка(Г) + ".xml";
	
	В = Новый ЗаписьXML;
    В.ОткрытьФайл(ПутьКФайлу); 
    В.ЗаписатьОбъявлениеXML(); 
    В.ЗаписатьНачалоЭлемента("unloading_from_subagent"); 
	В.ЗаписатьНачалоЭлемента("unload_type");
	В.ЗаписатьТекст("subagent_week_report"); 
	В.ЗаписатьКонецЭлемента();
	
	
	В.ЗаписатьНачалоЭлемента("ctPartner");
	
	В.ЗаписатьНачалоЭлемента("id");
	В.ЗаписатьТекст("56"); 
	В.ЗаписатьКонецЭлемента();
	
	В.ЗаписатьНачалоЭлемента("jurFace");
	В.ЗаписатьСекциюCDATA("ЗАО «СТРИЖ-Логистик»"); 
	В.ЗаписатьКонецЭлемента();
	
	В.ЗаписатьКонецЭлемента();
	
	
	В.ЗаписатьНачалоЭлемента("ctReportInfo");
	
	В.ЗаписатьНачалоЭлемента("date_crate");
	В.ЗаписатьТекст(Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	В.ЗаписатьКонецЭлемента();
	
	В.ЗаписатьНачалоЭлемента("period");
	В.ЗаписатьТекст(Формат(НачДата, "ДФ=dd.MM.yyyy") + "-" + Формат(КонДата, "ДФ=dd.MM.yyyy"));
	В.ЗаписатьКонецЭлемента();
	
	
	В.ЗаписатьКонецЭлемента();
	
	
	В.ЗаписатьНачалоЭлемента("Orders");
	
	Пока Выб.Следующий() Цикл
		В.ЗаписатьНачалоЭлемента("Order");
		В.ЗаписатьНачалоЭлемента("subagentOrderId");
		В.ЗаписатьТекст(СокрЛП(Выб.Номер));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("ctOrderIdentity");
		
		В.ЗаписатьНачалоЭлемента("orderId");
		//В.ЗаписатьТекст(Выб.Номер);
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("barcode");
		В.ЗаписатьТекст(Выб.ВнешнийНомерЗаказа);
		В.ЗаписатьКонецЭлемента();
		
		Ном2 = СтрПолучитьСтроку(СтрЗаменить(Выб.ВнешнийНомерЗаказа, "*", Символы.ПС), 2);
		
		В.ЗаписатьНачалоЭлемента("webshopNumber");
		В.ЗаписатьТекст(Ном2);
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьКонецЭлемента();
		
		
		
		
		В.ЗаписатьНачалоЭлемента("ctOrderWeightVolume");
		
		В.ЗаписатьНачалоЭлемента("weight");
		В.ЗаписатьТекст(Формат(Выб.Вес, "ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("length");
		В.ЗаписатьТекст("0");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("width");
		В.ЗаписатьТекст("0");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("height");
		В.ЗаписатьТекст("0");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьКонецЭлемента();

		
		
		Если Не ЗначениеЗаполнено(Выб.КоличествоДополнительныхВызовов) Тогда
			УслугиСД = Выб.СтоимостьДоставки;
			СтоимостьДопВыездов = 0;
		Иначе
			УслугиСД = Выб.СтоимостьДоставки/(Выб.КоличествоДополнительныхВызовов + 1);
			СтоимостьДопВыездов = Выб.КоличествоДополнительныхВызовов*УслугиСД;
		КонецеСли;	
		
		
		В.ЗаписатьНачалоЭлемента("ctOrderPaidParams");
		
		В.ЗаписатьНачалоЭлемента("client_cost");
		В.ЗаписатьТекст(Формат(Выб.СуммаЗаказаНал, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();

		В.ЗаписатьНачалоЭлемента("client_paid");
		В.ЗаписатьТекст(Формат(Выб.ПолученоОтПокупателя, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("ctOrderPartnerServiceCostParams");
		
		В.ЗаписатьНачалоЭлемента("deliveryCost");
		В.ЗаписатьТекст(Формат(УслугиСД, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("receptPaidCost");
		В.ЗаписатьТекст(Формат(Выб.КассовоеОбслуживание, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("returnCost");
		В.ЗаписатьТекст(Формат(Выб.СуммаВозврата, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("liftCost");
		В.ЗаписатьТекст(Формат(Выб.Подъем, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("additionalExitCost");
		В.ЗаписатьАтрибут("count", Формат(Выб.КоличествоДополнительныхВызовов, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьТекст(Формат(СтоимостьДопВыездов, "ЧДЦ=; ЧН=0; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("correctCost");
		В.ЗаписатьТекст("0");
		В.ЗаписатьКонецЭлемента();
		
		
		В.ЗаписатьКонецЭлемента();
		
		
		В.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	
	В.ЗаписатьКонецЭлемента();
	
	// заборы 
	Зап.Текст = ТекстЗапросаЗаборов();
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачДата));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонДата));			
	Зап.УстановитьПараметр("МасКонтр", МассивКонтр);			
	
	Выб = Зап.Выполнить().Выбрать();
	В.ЗаписатьНачалоЭлемента("shipments");
	Пока Выб.Следующий() Цикл
		В.ЗаписатьНачалоЭлемента("shipment");
		
		В.ЗаписатьНачалоЭлемента("shipmentId");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("shipmentDirection");
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("intakeDate");
		В.ЗаписатьТекст(Формат(Выб.ДатаЗабора, "ДФ=yyyy-MM-dd"));
		В.ЗаписатьКонецЭлемента();

		В.ЗаписатьНачалоЭлемента("intakeServiceCost");
		В.ЗаписатьТекст(Формат(Выб.СтоимостьДоставки, "ЧДЦ=; ЧГ="));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьНачалоЭлемента("intakeAddress");
		В.ЗаписатьТекст(СокрЛП(Выб.АдресЗабора));
		В.ЗаписатьКонецЭлемента();
		
		В.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	
	В.ЗаписатьКонецЭлемента();
	
	В.ЗаписатьКонецЭлемента();
	В.Закрыть();
	
	Ф = Новый ДвоичныеДанные(ПутьКФайлу);
	
	Возврат ПутьКФайлу;	
КонецФункции
